Tekla Open API Reference for Tekla Structures 2025
MaterialItem.PoissonsRatio Property
 The poissons ratio
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double PoissonsRatio { get; set; }
Public Property PoissonsRatio As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
MaterialItem Class
Tekla.Structures.Catalogs Namespace